{
  "races": [
    {
      "name": "Dragonborn",
      "description": "Dragonborn have draconic features and take great pride in their heritage. They are often seen as outsiders and strive to meet the standards of draconic strength and honor. Dragonborn reflect their draconic heritage, having a Breath Weapon based on their dragon ancestry and resistance to the corresponding elemental damage.",
      "abilityScoreIncrease": [
        {"Strength": 2},
        {"Charisma": 1}
      ],
      "speed": 30,
      "languages": [
        "Common",
        "Draconic"
      ],
      "features": [
        "Draconic Ancestry",
        "Breath Weapon",
        "Damage Resistance"
      ]
    },
    {
      "name": "Hill Dwarf",
      "description": "Dwarves are stout and strong, known for their skill in forging and mining. They value tradition and live in mountainous or underground cities. Dwarves have increased Constitution scores and resistance to poison. They are also proficient with certain weapons and tools, showcasing their craftsmanship. Hill dwarves are a subrace of dwarves with keen senses, intuition, and resilience.",
      "abilityScoreIncrease": [
        {"Constitution": 2},
        {"Wisdom": 1}
      ],
      "hpBonus": 1,
      "speed": 25,
      "weaponProficiency": [
        "Battleaxe",
        "Handaxe",
        "Light hammer",
        "Warhammer"
      ],
      "toolProficiency": [
        {
          "select": 1,
          "options": [
            "artisansTools"
          ]
        }
      ],
      "languages": [
        "Common",
        "Dwarvish"
      ],
      "features": [
        "Darkvision",
        "Dwarven Resilience",
        "Dwarven Combat Training",
        "Artisan's Tool Proficiency",
        "Stonecunning",
        "Dwarven Toughness"
      ]
    },
    {
      "name": "Mountain Dwarf",
      "description": "Dwarves are stout and strong, known for their skill in forging and mining. They value tradition and live in mountainous or underground cities. Dwarves have increased Constitution scores and resistance to poison. They are also proficient with certain weapons and tools, showcasing their craftsmanship. Hill dwarves are a subrace of dwarves who are strong and hardy, accustomed to life in a difficult terrain.",
      "abilityScoreIncrease": [
        {"Constitution": 2},
        {"Stength": 2}
      ],
      "speed": 25,
      "weaponProficiency": [
        "Battleaxe",
        "Handaxe",
        "Light Hammer",
        "Warhammer"
      ],
      "armorProficiency": [
        "Light armor",
        "Medium armor"
      ],
      "toolProficiency": [
        {
          "select": 1,
          "options": [
            "artisansTools"
          ]
        }
      ],
      "languages": [
        "Common",
        "Dwarvish"
      ],
      "features": [
        "Darkvision",
        "Dwarven Resilience",
        "Dwarven Combat Training",
        "Artisan's Tool Proficiency",
        "Stonecunning",
        "Dwarven Armor Training"
      ]
    },
    {
      "name": "High Elf",
      "description": "Known for their grace and longevity, elves live in natural settings and are often seen as aloof. They come in different kinds, including high elves, wood elves, and dark elves (drow). Elves have keen senses and intuition, reflected in their proficiency in Perception. They also have Fey Ancestry, which grants them advantage on saving throws against being charmed, and immunity to magical sleep.  High elves are a subrace of elves who have a keen mind and mastery over the basics of magic.",
      "abilityScoreIncrease": [
        {"Dexterity": 2},
        {"Intelligence": 1}
      ],
      "speed": 30,
      "weaponProficiency": [
        "Longsword",
        "Shortsword",
        "Shortbow",
        "Longbow"
      ],
      "toolProficiency": [
        {
          "select": 1,
          "options": [
            "artisansTools"
          ]
        }
      ],
      "languages": [
        "Common",
        "Elvish",
        "choose1"
      ],
      "features": [
        "Darkvision",
        "Keen Senses",
        "Fey Ancestry",
        "Trance",
        "Elf Weapon Training",
        "Cantrip",
        "Extra Language"
      ],
      "skillsProficiency": [
        "Perception"
      ]
    },
    {
      "name": "Wood Elf",
      "description": "Known for their grace and longevity, elves live in natural settings and are often seen as aloof. They come in different kinds, including high elves, wood elves, and dark elves (drow). Elves have keen senses and intuition, reflected in their proficiency in Perception. They also have Fey Ancestry, which grants them advantage on saving throws against being charmed, and immunity to magical sleep. Wood Elves are a subrace of elves who have strong senses and intuition, useful for quickly and stealthily navigating their native forests.",
      "abilityScoreIncrease": [
        {"Dexterity": 2},
        {"Wisdom": 1}
      ],
      "speed": 35,
      "weaponProficiency": [
        "Longsword",
        "Shortsword",
        "Shortbow",
        "Longbow"
      ],
      "languages": [
        "Common",
        "Elvish"
      ],
      "features": [
        "Darkvision",
        "Keen Senses",
        "Fey Ancestry",
        "Trance",
        "Elf Weapon Training",
        "Fleet of Foot",
        "Mask of the Wild"
      ],
      "skillsProficiency": [
        "Perception"
      ]
    },
    {
      "name": "Rock Gnome",
      "description": "Gnomes are small, energetic, and thrive on innovation and invention. They often live in whimsical communities filled with mechanical wonders. Gnomes are intelligent and cunning, with a bonus to Intelligence. They also have Gnome Cunning, which gives them advantage on all Intelligence, Wisdom, and Charisma saving throws against magic. Rock Gnomes are a subrace of gnomes known for their inventive spirit and hardiness.",
      "abilityScoreIncrease": [
        {"Intelligence": 2},
        {"Constitution": 1}
      ],
      "speed": 25,
      "toolProficiency": [
        "Tinker's Tools"
      ],
      "languages": [
        "Common",
        "Gnomish"
      ],
      "features": [
        "Darkvision",
        "Gnome Cunning",
        "Artificer's Lore",
        "Tinker"
      ]
    },
    {
      "name": "Half-Elf",
      "description": "Half-elves blend human and elven traits. They often feel like outsiders as they don’t fully fit into the societies of either race. This gives them a unique perspective that makes them excellent diplomats and negotiators. Half-elves gain a +2 bonus to Charisma and a +1 bonus to two other ability scores of their choice, reflecting their mixed heritage. They also have Darkvision, allowing them to see in low light conditions, and they have advantage on saving throws against being charmed and cannot be put to sleep by magic, thanks to their elven blood.",
      "abilityScoreIncrease": [
        {"Charisma": 2},
        {
          "select": 2,
          "options": [
            "all"
          ],
          "value": 1
        }
      ],
      "speed": 30,
      "languages": [
        "Common",
        "Elvish",
        {
          "select": 1,
          "options": [
            "all"
          ]
        }
      ],
      "features": [
        "Darkvision",
        "Fey Ancestry",
        "Skill Versatility"
      ],
      "skillsProficiency": [
        {
          "select": 2,
          "options": [
            "all"
          ]
        }
      ]
    },
    {
      "name": "Lightfoot Halfling",
      "description": "Small and unassuming, halflings live in pastoral idylls or quiet boroughs. They love peace and comfort but are surprisingly resourceful and brave. Halflings are lucky, which allows them to reroll 1s on d20 rolls once. They are also nimble and can move through the space of larger creatures. Lightfoot Halflings are a subrace of halflings are prone to wanderlust and excellent at stealth.",
      "abilityScoreIncrease": [
        {"Dexterity": 2},
        {"Charisma": 1}
      ],
      "speed": 25,
      "languages": [
        "Common",
        "Halfling"
      ],
      "features": [
        "Lucky",
        "Brave",
        "Halfling Nimbleness",
        "Naturally Stealthy"
      ]
    },
    {
      "name": "Stout Halfling",
      "description": "Small and unassuming, halflings live in pastoral idylls or quiet boroughs. They love peace and comfort but are surprisingly resourceful and brave. Halflings are lucky, which allows them to reroll 1s on d20 rolls once. They are also nimble and can move through the space of larger creatures. Stout Halflings are a subrace of halflings that are very hardy and are commonly referred to as 'stronghearts'.",
      "abilityScoreIncrease": [
        {"Dexterity": 2},
        {"Constitution": 1}
      ],
      "speed": 25,
      "languages": [
        "Common",
        "Halfling"
      ],
      "features": [
        "Lucky",
        "Brave",
        "Halfling Nimbleness",
        "Stout Resilience"
      ]
    },
    {
      "name": "Half-Orc",
      "description": "Half-orcs bear the physical marks of their orc heritage with pride, often facing prejudice from both orc and human societies. They are known for their strength, courage, and tenacity. Many half-orcs strive to overcome stereotypical expectations by proving their worth as loyal and competent companions. Half-orcs receive a +2 bonus to Strength and a +1 to Constitution, highlighting their toughness and physical power. They have the Relentless Endurance trait, which allows them to drop to 1 hit point instead of 0 once per day when they would normally be knocked out. Additionally, they possess the Savage Attacks trait, which gives them extra dice of damage on critical hits with melee weapons.",
      "abilityScoreIncrease": [
        {"Stength": 2},
        {"Constitution": 1}
      ],
      "speed": 30,
      "languages": [
        "Common",
        "Orc"
      ],
      "features": [
        "Darkvision",
        "Menacing",
        "Relentless Endurance",
        "Savage Attacks"
      ],
      "skillsProficiency": [
        "Intimidation"
      ]
    },
    {
      "name": "Human",
      "description": "The most ubiquitous race in most D&D worlds, humans are known for their adaptability and diversity. They are young, ambitious, and cover a wide range of cultures. Humans gain a +1 bonus to all their ability scores, reflecting their versatile nature.",
      "abilityScoreIncrease": [
        {"Stength": 1},
        {"Dexterity": 1},
        {"Constitution": 1},
        {"Intelligence": 1},
        {"Wisdom": 1},
        {"Charisma": 1}
      ],
      "speed": 30,
      "languages": [
        "Common",
        {
          "select": 1,
          "options": [
            "all"
          ]
        }
      ]
    },
    {
      "name": "Tiefling",
      "description": "Born of a human and infernal bloodline, tieflings often face prejudice due to their demonic features. They are resourceful and strong-willed, often driven by a desire to prove themselves. Tieflings have infernal heritage which provides them with resistance to fire and spells like Thaumaturgy. They also get a bonus to Intelligence and Charisma.",
      "abilityScoreIncrease": [
        {"Intelligence": 1},
        {"Charisma": 2}
      ],
      "speed": 30,
      "languages": [
        "Common",
        "Infernal"
      ],
      "features": [
        "Darkvision",
        "Hellish Reistance",
        "Infernal Legacy"
      ]
    }
  ]
}